---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir2WithSpacing
source: html/438e8d5a-134b-c8f8-221d-b47af84db2b8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir2WithSpacing Property

"Top/Exterior Minor"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemLayerSummaryTopDir2WithSpacing { get; }
```